

==========================================
SW1
==========================================

en
conf t
!
hostname SW1
!
spanning-tree mode rapid-pvst
!
vlan 10
vlan 20
!
int range f0/1-2
 switchport trunk encapsulation dot1q 
 switchport mode trunk
 switchport trunk allowed vlan 10,20
exit
!
int f0/3
 switchport mode access
 switchport access vlan 10
 spanning-tree portfast
 spanning-tree bpduguard enable
 spanning-tree bpdufilter enable
exit
#DHCP POOL:
interface vlan 20
ip helper-address 192.168.20.254
interface vlan 40
ip helper-address 192.168.40.254
exit
!


=====================
SW2
=====================

en
conf t
!
hostname SW2
!
spanning-tree mode rapid-pvst
!
vlan 10
vlan 20
!
int f0/1
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 10,20
exit
int f0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 10,20
exit
!
int f0/3
 spanning-tree portfast
 spanning-tree bpduguard enable
 spanning-tree bpdufilter enable
 switchport mode access
 switchport access vlan 20
exit
!
#DHCP POOL:
interface vlan 20
ip helper-address 192.168.20.254
interface vlan 40
ip helper-address 192.168.40.254
exit


=====================
SW3
=====================

en
conf t
!
hostname SW3
!
vlan 30
vlan 40
!
int f0/1
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 30,40
exit
int f0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 30,40
exit
!
int f0/3
 spanning-tree portfast
 spanning-tree bpduguard enable
 spanning-tree bpdufilter enable
 switchport mode access
 switchport access vlan 30
exit
!
spanning-tree mst configuration
name EXAMEN_CCNP
revision 1
!
spanning-tree mst configuration
instance 1 vlan 30
instance 2 vlan 40
exit
!
spanning-tree mode mst
!
#DHCP POOL:
interface vlan 20
ip helper-address 192.168.20.254
interface vlan 40
ip helper-address 192.168.40.254
!
exit



=====================
SW4
=====================

en
conf t
!
hostname SW4
!
vlan 30
vlan 40
!
int f0/1
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 30,40
exit
int f0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 30,40
exit
!
int f0/3
 spanning-tree portfast
 spanning-tree bpduguard enable
 spanning-tree bpdufilter enable
 switchport mode access
 switchport access vlan 40
exit
!
spanning-tree mst configuration
name EXAMEN_CCNP
revision 1
!
spanning-tree mst configuration
instance 1 vlan 30
instance 2 vlan 40
exit
!
spanning-tree mode mst
!
#DHCP POOL:
interface vlan 20
ip helper-address 192.168.20.254
interface vlan 40
ip helper-address 192.168.40.254
!
exit
